logs/bench_20250912_131507.txt
================= 压力测试报告 =================
时间: 2025年 9月12日 星期五 13时15分07秒 CST

>>> 测试 1: 单节点下载 (Node 9001)
Running 15s test @ http://localhost:9001/get_chunk?file_id=1509&chunk_index=0
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.56ms    3.79ms  79.80ms   95.73%
    Req/Sec     2.69k   322.43     3.00k    86.33%
  80532 requests in 15.02s, 13.75MB read
Requests/sec:   5362.27
Transfer/sec:      0.92MB

>>> 测试 2: 单节点下载 (Node 9002)
Running 30s test @ http://localhost:9002/get_chunk?file_id=1509&chunk_index=0
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.20ms    2.65ms  50.15ms   96.07%
    Req/Sec     1.38k   104.39     1.63k    87.42%
  165373 requests in 30.06s, 28.23MB read
Requests/sec:   5501.12
Transfer/sec:      0.94MB

>>> 测试 3: 节点监控接口 (Node 9001)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            9001

Document Path:          /metries
Document Length:        22 bytes

Concurrency Level:      100
Time taken for tests:   0.414 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      173000 bytes
HTML transferred:       22000 bytes
Requests per second:    2418.10 [#/sec] (mean)
Time per request:       41.355 [ms] (mean)
Time per request:       0.414 [ms] (mean, across all concurrent requests)
Transfer rate:          408.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      0      10
Processing:     8   40  22.6     33     109
Waiting:        6   30  19.5     23      96
Total:          8   40  22.6     33     109

Percentage of the requests served within a certain time (ms)
  50%     33
  66%     37
  75%     44
  80%     52
  90%     99
  95%    100
  98%    100
  99%    108
 100%    109 (longest request)

>>> 测试 4: 上传接口 (Node 9001)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            9001

Document Path:          /store_chunk
Document Length:        254 bytes

Concurrency Level:      20
Time taken for tests:   0.196 seconds
Complete requests:      500
Failed requests:        0
Non-2xx responses:      500
Total transferred:      208500 bytes
Total body sent:        85500
HTML transferred:       127000 bytes
Requests per second:    2554.68 [#/sec] (mean)
Time per request:       7.829 [ms] (mean)
Time per request:       0.391 [ms] (mean, across all concurrent requests)
Transfer rate:          1040.33 [Kbytes/sec] received
                        426.61 kb/s sent
                        1466.95 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     3    7   0.7      8      10
Waiting:        1    6   1.1      6       8
Total:          3    8   0.6      8      10
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      8
  90%      8
  95%      8
  98%      9
  99%      9
 100%     10 (longest request)

>>> 测试 5: 元数据服务查询 (尝试 file/list_file 到 node/list_nodes)
[INFO] 使用 http://127.0.0.1:8000/file/list_files 进行压测
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /file/list_files
Document Length:        36871 bytes

Concurrency Level:      50
Time taken for tests:   14.742 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      37018000 bytes
HTML transferred:       36871000 bytes
Requests per second:    67.83 [#/sec] (mean)
Time per request:       737.086 [ms] (mean)
Time per request:       14.742 [ms] (mean, across all concurrent requests)
Transfer rate:          2452.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    15  723 236.6    719    2171
Waiting:       15  711 236.0    705    2159
Total:         16  724 236.6    719    2171

Percentage of the requests served within a certain time (ms)
  50%    719
  66%    762
  75%    793
  80%    822
  90%   1017
  95%   1132
  98%   1280
  99%   1497
 100%   2171 (longest request)